{
  "bbplat": "BBPlatforms IT Solutions",
  "bio": "Angetrieben von dem Ziel, KI-Innovationen in zugängliche und effektive Softwarelösungen zu verwandeln, mit einem starken Engagement für sauberen Code und bewährte Praktiken. Leidenschaftlich daran interessiert, durch kontinuierliche Auseinandersetzung mit der neuesten Forschung an der Spitze des maschinellen Lernens zu bleiben.",
  "birthday": "13.12.1996",
  "eckert": "Eckert&Partner IT Consulting",
  "eckert_1": "Entwicklung der Webanwendungen für das Mietmanagement von Mateco GmbH unter Verwendung von Spring Boot und Angular in einem großen international aufgestellten Team.",
  "eckert_2": "Entwicklung und Implementierung interner Management-Tools bei Eckert & Partner IT Consulting.",
  "eckert_role": "SOFTWARE ENGINEER (Werkstudent)",
  "eckert_time": "April 2019 - Juli 2022",
  "education": "AUSBILDUNG",
  "compling": "M.Sc. Computerlinguistik",
  "compsci": "B.Sc. Informatik",
  "compsci_focus": "Grundlagen der KI, Maschinelles Lernen, Wissenschaftliches Rechnen, Informationssicherheit, Computergrafik",
  "compsci_thesis": "Untersuchung von selbstgelernten Optimierungsalgorithmen Nullter-Ordnung",
  "DE": "Deutsch",
  "EN": "Englisch",
  "experience": "BERUFSERFAHRUNG",
  "football_scorps": "Ehemaliger Mannschaftskapitän des Stuttgart Scorpions GFL-Teams",
  "football_national": "Deutsche U19-Nationalmannschaft, 2. Platz Europameisterschaft 2015",
  "forge_time": "März 2025",
  "forge_1": "Low-Level-Tool zur PDF-Inspektion und -Fehlersuche. Geschrieben in TS unter Verwendung von Svelte und pdf.js.",
  "stuttgart": "Stuttgart, Deutschland",
  "hs_diploma": "Abitur",
  "interests": "HOBBYS",
  "knecon_1": "Entwicklung einer KI-gestützten Plattform zur Analyse von PDF-Dokumenten als SaaS mit einem kleinen Team",
  "knecon_2": "Zusammenarbeit mit der Forschungsabteilung zur Erweiterung der Plattform mit einer RAG-basierten Dokumentendatensatz-Explorationsfunktion.",
  "knecon_3": "Projekte die ich entworfen und geleitet habe:",
  "knecon_3_0": "Cloud-fähige Datenstruktur für Dokumente zur Darstellung und Analyse.",
  "knecon_3_1": "OCR-Dienste für On-Premise und Cloud-Nutzung, unter Verwendung von Leptonica und Ghostscript zur Bildverarbeitung sowie Tesseract/Azure IDP/Apryse OCR als Engines.",
  "knecon_3_2": "Kern-Analysedienst unter Verwendung der Drools-Engine mit zur Laufzeit austauschbaren Regelsets.",
  "knecon_3_3": "Individueller PDF-Layout-Parsing-Dienst, mit einer Mischung aus Algorithmen und maschinellem Lernen.",
  "knecon_3_4": "LLM-gestützter Copilot zum Drools-Regeln schreiben.",
  "knecon_3_5": "LLM-gestützter NER-Dienst zur Unterstützung der Drools-Engine.",
  "knecon_4": "Bereitstellung containerisierter Anwendungen mit Docker, Kubernetes, Helm und Rancher sowie Optimierung von CI/CD-Pipelines mit GitLab.",
  "knecon_5": "Beteiligung am Einstellungsprozess mehrerer neuer Kolleg:innen.",
  "knecon_time": "Januar 2023 - heute",
  "languages": "SPRACHEN",
  "location": "Anemonenweg 21, 683005 Mannheim",
  "mannheim": "Mannheim, Deutschland",
  "nasa_time": "März - Dezember 2020",
  "nasa_1": "Vorrücken in die Finalrunde und erreichen des 2. Platz von 168 Teams.",
  "nasa_2": "Entwicklung von stereo-matching und Bildverarbeitung auf einem FPGA-Prozessor zur Mineralerkennung.",
  "piano": "Klavier",
  "profile": "Profil",
  "projects": "PROJEKTE",
  "bbplat_1": "Wartung der IT-Infrastruktur für Wulf Architekten GmbH.",
  "itadm_time": "April 2018 - April 2019",
  "itadm": "IT-Administrator (Werkstudent)",
  "skills": "FÄHIGKEITEN",
  "uni_stuttgart": "Universität Stuttgart"
}
