{
  "apiarium_desc": " - Python toolkit for API + interfaces: 'write once, run anywhere' app as CLI, TUI, REPL, and via the Matrix protocol",
  "backpackertrail": "Backpackertrail (internship)",
  "bpt_1": "Developed a reverse image search system for travel recommendations, built with TensorFlow.",
  "bpt_2": "Developed an automatic route-planning tool built with ORTools.",
  "bpt_time": "October 2020 - March 2021",
  "certificates": "CERTIFICATES",
  "compling": "M.Sc. Computational Linguistics",
  "datethyme_desc": " - ergonomic datetime types built on Pydantic, emphasizing parsing and arithmetic",
  "DE": "German",
  "econ_department": "BYU Economics Department",
  "econ": "B.S. Economics",
  "EN": "English",
  "ES": "Spanish",
  "experience": "EXPERIENCE",
  "FR": "French",
  "heidelberg": "Heidelberg, Germany",
  "hs_diploma": "High School Diploma",
  "interests": "INTERESTS",
  "knecon_1": "Helped develop an LLM-based document analysis platform with retrieval-augmented generation and integration of external data sources.",
  "knecon_2": "Used AzureML, MLFlow, Gitlab CI/CD and Kubernetes for development and deployment of machine learning pipelines.",
  "knecon_3": "Designed, trained, and deployed the NLU-/NER-based interface for an integrated desktop search tool.",
  "knecon_4": "Developed a face redaction service using dlib, C++, and Python.",
  "knecon_5": "Created and maintained numerous utility packages and infrastructural tools for internal use.",
  "knecon_time": "October 2021 - present",
  "location": "Rhein-Neckar Region",
  "mannheim": "Mannheim, Germany",
  "nbcat_desc": " - cat command for Jupyter notebooks, written in Go",
  "profile": "Deep expertise in Python, machine learning, and Nix, complemented by proficiency in a wide array of other languages and tools. Committed to clean, maintainable software design emphasizing scalability, clarity, and robustness. Firm believer in the power of static type-checking (mypy), data models and validation (pydantic), thorough testing (pytest), and pre-commit hooks (lefthook).",
  "ra_1": "Implemented an XGBoost-driven system for entity matching across historical records for historical economics research. Created a pipeline for cleaning and entity recognition of patent records.",
  "ra_2": "Created a pipeline for cleaning and entity recognition of patent records.",
  "ra_3": "Published two peer-reviewed academic articles as a co-author.",
  "ra_time": "July 2015 - May 2019",
  "research_assistant": "RESEARCH ASSISTANT",
  "RU": "Russian",
  "UK": "Ukrainian",
  "uni_stuttgart": "University of Stuttgart"
}